# Simple average

### Напишите программу, которая считывает с клавиатуры два числа a и b, считает и выводит на консоль среднее арифметическое всех чисел из отрезка [a;b], которые кратны числу 3.

## Code:

<pre>
a = int(input())
b = int(input())
s = 0
cnt = 0
for i in range(a, b + 1):
    if i % 3 == 0:
        s += i
        cnt += 1
print(s / cnt)
