# Coded sequence

### Напишите программу, которая считывает строку, кодирует её алгоритмом и выводит закодированную последовательность на стандартный вывод. Кодирование должно учитывать регистр символов.

### Кодирование осуществляется следующим образом:
### s = 'aaaabbсaa' преобразуется в 'a4b2с1a2', то есть группы одинаковых символов исходной строки заменяются на этот символ и количество его повторений в этой позиции строки.

## Code:

<pre>
s = input()
l = len(s)
cnt = 1
for i in range(l):
    if i == (l - 1):
        print(s[i] + str(cnt), end='')
    else:
        if s[i] == s[i + 1]:
            cnt = cnt + 1
        else:
            print(s[i] + str(cnt), end='')
            cnt = 1
